app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO `articles` (`title`, `body`, `created_at`, `updated_at`) VALUES ('Article1', 'Article description1', '2020-09-03 14:41:51', '2020-09-03 14:41:51')

  def update
    respond_to do |format|
      if @article.update(article_params)
---
UPDATE `articles` SET `title` = 'Article2', `body` = 'Article description2', `updated_at` = '2020-09-03 14:39:32' WHERE `articles`.`id` = 1

  def destroy
    @article.destroy
---
DELETE FROM `articles` WHERE `articles`.`id` = 1

  def set_article
    @article = Article.find(params[:id])
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1